In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [3]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [4]:
df = pd.DataFrame(d)

In [5]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [9]:
df.dropna(axis=1) #columnda nan olanlar gider

   C
0  1
1  2
2  3

In [11]:
df.dropna(thresh=2) #satırda 2 tane nan olamayan değer olanlar gider

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [17]:
df.dropna(thresh=3)

     A    B  C
0  1.0  5.0  1

In [18]:
#fillna

In [20]:
df.fillna('Fill Value')

            A           B  C
0         1.0         5.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

In [21]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [22]:
df['A'].fillna('A')

0    1.0
1    2.0
2      A
Name: A, dtype: object

In [24]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64